<a href="https://colab.research.google.com/github/Yassinlazaar/App/blob/main/Lab_1_Pandas_and_Data_manipulation_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# <font color='red'> Introduction</font> 
This lab is an introduction to Pandas. We will explore how to read data, get summary statistics and information about it, manipulate it, subset it etc.

# <font color='red'> 1. Importing the library</font>

In [ ]:
import pandas as pd

# <font color='red'> 2. Reading data</font>

In [7]:
titanic= pd.read_csv("train_titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# <font color='red'> 3. columns, index, values</font> 
* Extract the names of the columns in this dataset?
* What is the last index in the dataset?
* Extract the values of this dataset and put them in an array

In [9]:
print(titanic.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
print(titanic.index)

RangeIndex(start=0, stop=891, step=1)

In [ ]:
print(titanic.values)

# <font color='red'> 4. Basic Information about the data</font> 
* How many rows do we have in this dataset? how many columns?
* What is the size of this dataset?
* What are the types of the variables in this dataset?

In [11]:
print ( titanic.shape)

(891, 12)

In [14]:
print (titanic.shape[0])
print (titanic.shape[1])

print(len(titanic.index))

891
12
891

In [16]:
print(titanic.size)

10692

In [17]:
print(titanic.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [19]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# <font color='red'> 5. Summary statistics</font> 
* Print a table summarizing information about the columns
* Introduce aggregate functions

In [20]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [21]:
titanic.describe(include="all")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

# <font color='red'> 6. Columns Subsetting</font> 
* From the dataframe titanic, select the column age
* From the dataframe titanic, create a new dataframe containing the columns "Pclass" and "Fare"

In [26]:
age_column=titanic["Age"]
age_column.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [27]:
pclass_and_fare=titanic[["Pclass","Fare"]]
pclass_and_fare.head()

   Pclass     Fare
0       3   7.2500
1       1  71.2833
2       3   7.9250
3       1  53.1000
4       3   8.0500

# <font color='red'> 7. Creating a new column</font> 
* The Titanic sank in 1912. Since then the value of a dollar has changd. The column "Fare" indicates how much each passenger paid for his/her ticket. Those prices are outdated. We want to create a new column "Fare2022" showing how much each titanic ticket would cost today. 
    * 1 dollar in 1912 is the equivalent of 30.54 dollars today

In [28]:
titanic["Fare2022"]=titanic["Fare"]*30

In [29]:
titanic[["Fare","Fare2022"]].describe

<bound method NDFrame.describe of         Fare  Fare2022
0     7.2500   217.500
1    71.2833  2138.499
2     7.9250   237.750
3    53.1000  1593.000
4     8.0500   241.500
..       ...       ...
886  13.0000   390.000
887  30.0000   900.000
888  23.4500   703.500
889  30.0000   900.000
890   7.7500   232.500

[891 rows x 2 columns]>

# <font color='red'> 8. Conditional subsetting</font> 
* Create a new dataframe "titanic_first_class" from titanic dataframe containing only the passengers from First class
* Create a new dataframe "old_first_class" from titanic dataframe containing passengers from first class that are older than 65
* Using the isin() function create a new dataframe "first_and_second_class" containing the passengers from first and second class

In [35]:
titanic_first_class=titanic[titanic["Pclass"]==1]
titanic_first_class.shape

(216, 13)

In [38]:
first_and_second_class=titanic[titanic["Pclass"].isin([1,2])]
first_and_second_class.shape

(400, 13)

# <font color='red'> 9. Sorting dataframes</font> 
* sort the dataframe titanic by fare in descending order
* sort the data frame by ascending fare then descending class

# <font color='BLUE'> Exercise </font> 
* sort the dataframe titanic by fare in descending order
* sort the data frame by ascending fare then descending class